analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/dma_regs.h
#define MXC_F_DMA_CN_CH2_IEN_POS                       2 /**< CN_CH2_IEN Position */
#define MXC_F_DMA_CN_CH2_IEN                           ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH2_IEN_POS)) /**< CN_CH2_IEN Mask */
#define MXC_V_DMA_CN_CH2_IEN_DIS                       ((uint32_t)0x0UL) /**< CN_CH2_IEN_DIS Value */
#define MXC_S_DMA_CN_CH2_IEN_DIS                       (MXC_V_DMA_CN_CH2_IEN_DIS << MXC_F_DMA_CN_CH2_IEN_POS) /**< CN_CH2_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH2_IEN_EN                        ((uint32_t)0x1UL) /**< CN_CH2_IEN_EN Value */
#define MXC_S_DMA_CN_CH2_IEN_EN                        (MXC_V_DMA_CN_CH2_IEN_EN << MXC_F_DMA_CN_CH2_IEN_POS) /**< CN_CH2_IEN_EN Setting */

#define MXC_F_DMA_CN_CH3_IEN_POS                       3 /**< CN_CH3_IEN Position */
#define MXC_F_DMA_CN_CH3_IEN                           ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH3_IEN_POS)) /**< CN_CH3_IEN Mask */
#define MXC_V_DMA_CN_CH3_IEN_DIS                       ((uint32_t)0x0UL) /**< CN_CH3_IEN_DIS Value */
#define MXC_S_DMA_CN_CH3_IEN_DIS                       (MXC_V_DMA_CN_CH3_IEN_DIS << MXC_F_DMA_CN_CH3_IEN_POS) /**< CN_CH3_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH3_IEN_EN                        ((uint32_t)0x1UL) /**< CN_CH3_IEN_EN Value */
#define MXC_S_DMA_CN_CH3_IEN_EN                        (MXC_V_DMA_CN_CH3_IEN_EN << MXC_F_DMA_CN_CH3_IEN_POS) /**< CN_CH3_IEN_EN Setting */

#define MXC_F_DMA_CN_CH4_IEN_POS                       4 /**< CN_CH4_IEN Position */
#define MXC_F_DMA_CN_CH4_IEN                           ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH4_IEN_POS)) /**< CN_CH4_IEN Mask */
#define MXC_V_DMA_CN_CH4_IEN_DIS                       ((uint32_t)0x0UL) /**< CN_CH4_IEN_DIS Value */
#define MXC_S_DMA_CN_CH4_IEN_DIS                       (MXC_V_DMA_CN_CH4_IEN_DIS << MXC_F_DMA_CN_CH4_IEN_POS) /**< CN_CH4_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH4_IEN_EN                        ((uint32_t)0x1UL) /**< CN_CH4_IEN_EN Value */
#define MXC_S_DMA_CN_CH4_IEN_EN                        (MXC_V_DMA_CN_CH4_IEN_EN << MXC_F_DMA_CN_CH4_IEN_POS) /**< CN_CH4_IEN_EN Setting */

#define MXC_F_DMA_CN_CH5_IEN_POS                       5 /**< CN_CH5_IEN Position */
#define MXC_F_DMA_CN_CH5_IEN                           ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH5_IEN_POS)) /**< CN_CH5_IEN Mask */
#define MXC_V_DMA_CN_CH5_IEN_DIS                       ((uint32_t)0x0UL) /**< CN_CH5_IEN_DIS Value */
#define MXC_S_DMA_CN_CH5_IEN_DIS                       (MXC_V_DMA_CN_CH5_IEN_DIS << MXC_F_DMA_CN_CH5_IEN_POS) /**< CN_CH5_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH5_IEN_EN                        ((uint32_t)0x1UL) /**< CN_CH5_IEN_EN Value */
#define MXC_S_DMA_CN_CH5_IEN_EN                        (MXC_V_DMA_CN_CH5_IEN_EN << MXC_F_DMA_CN_CH5_IEN_POS) /**< CN_CH5_IEN_EN Setting */

#define MXC_F_DMA_CN_CH6_IEN_POS                       6 /**< CN_CH6_IEN Position */
#define MXC_F_DMA_CN_CH6_IEN                           ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH6_IEN_POS)) /**< CN_CH6_IEN Mask */
#define MXC_V_DMA_CN_CH6_IEN_DIS                       ((uint32_t)0x0UL) /**< CN_CH6_IEN_DIS Value */
#define MXC_S_DMA_CN_CH6_IEN_DIS                       (MXC_V_DMA_CN_CH6_IEN_DIS << MXC_F_DMA_CN_CH6_IEN_POS) /**< CN_CH6_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH6_IEN_EN                        ((uint32_t)0x1UL) /**< CN_CH6_IEN_EN Value */
#define MXC_S_DMA_CN_CH6_IEN_EN                        (MXC_V_DMA_CN_CH6_IEN_EN << MXC_F_DMA_CN_CH6_IEN_POS) /**< CN_CH6_IEN_EN Setting */

#define MXC_F_DMA_CN_CH7_IEN_POS                       7 /**< CN_CH7_IEN Position */
#define MXC_F_DMA_CN_CH7_IEN                           ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH7_IEN_POS)) /**< CN_CH7_IEN Mask */
#define MXC_V_DMA_CN_CH7_IEN_DIS                       ((uint32_t)0x0UL) /**< CN_CH7_IEN_DIS Value */
#define MXC_S_DMA_CN_CH7_IEN_DIS                       (MXC_V_DMA_CN_CH7_IEN_DIS << MXC_F_DMA_CN_CH7_IEN_POS) /**< CN_CH7_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH7_IEN_EN                        ((uint32_t)0x1UL) /**< CN_CH7_IEN_EN Value */
#define MXC_S_DMA_CN_CH7_IEN_EN                        (MXC_V_DMA_CN_CH7_IEN_EN << MXC_F_DMA_CN_CH7_IEN_POS) /**< CN_CH7_IEN_EN Setting */

#define MXC_F_DMA_CN_CH8_IEN_POS                       8 /**< CN_CH8_IEN Position */
#define MXC_F_DMA_CN_CH8_IEN                           ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH8_IEN_POS)) /**< CN_CH8_IEN Mask */
#define MXC_V_DMA_CN_CH8_IEN_DIS                       ((uint32_t)0x0UL) /**< CN_CH8_IEN_DIS Value */
#define MXC_S_DMA_CN_CH8_IEN_DIS                       (MXC_V_DMA_CN_CH8_IEN_DIS << MXC_F_DMA_CN_CH8_IEN_POS) /**< CN_CH8_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH8_IEN_EN                        ((uint32_t)0x1UL) /**< CN_CH8_IEN_EN Value */
#define MXC_S_DMA_CN_CH8_IEN_EN                        (MXC_V_DMA_CN_CH8_IEN_EN << MXC_F_DMA_CN_CH8_IEN_POS) /**< CN_CH8_IEN_EN Setting */

#define MXC_F_DMA_CN_CH9_IEN_POS                       9 /**< CN_CH9_IEN Position */
#define MXC_F_DMA_CN_CH9_IEN                           ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH9_IEN_POS)) /**< CN_CH9_IEN Mask */
#define MXC_V_DMA_CN_CH9_IEN_DIS                       ((uint32_t)0x0UL) /**< CN_CH9_IEN_DIS Value */
#define MXC_S_DMA_CN_CH9_IEN_DIS                       (MXC_V_DMA_CN_CH9_IEN_DIS << MXC_F_DMA_CN_CH9_IEN_POS) /**< CN_CH9_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH9_IEN_EN                        ((uint32_t)0x1UL) /**< CN_CH9_IEN_EN Value */
#define MXC_S_DMA_CN_CH9_IEN_EN                        (MXC_V_DMA_CN_CH9_IEN_EN << MXC_F_DMA_CN_CH9_IEN_POS) /**< CN_CH9_IEN_EN Setting */

#define MXC_F_DMA_CN_CH10_IEN_POS                      10 /**< CN_CH10_IEN Position */
#define MXC_F_DMA_CN_CH10_IEN                          ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH10_IEN_POS)) /**< CN_CH10_IEN Mask */
#define MXC_V_DMA_CN_CH10_IEN_DIS                      ((uint32_t)0x0UL) /**< CN_CH10_IEN_DIS Value */
#define MXC_S_DMA_CN_CH10_IEN_DIS                      (MXC_V_DMA_CN_CH10_IEN_DIS << MXC_F_DMA_CN_CH10_IEN_POS) /**< CN_CH10_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH10_IEN_EN                       ((uint32_t)0x1UL) /**< CN_CH10_IEN_EN Value */
#define MXC_S_DMA_CN_CH10_IEN_EN                       (MXC_V_DMA_CN_CH10_IEN_EN << MXC_F_DMA_CN_CH10_IEN_POS) /**< CN_CH10_IEN_EN Setting */

#define MXC_F_DMA_CN_CH11_IEN_POS                      11 /**< CN_CH11_IEN Position */
#define MXC_F_DMA_CN_CH11_IEN                          ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH11_IEN_POS)) /**< CN_CH11_IEN Mask */
#define MXC_V_DMA_CN_CH11_IEN_DIS                      ((uint32_t)0x0UL) /**< CN_CH11_IEN_DIS Value */
#define MXC_S_DMA_CN_CH11_IEN_DIS                      (MXC_V_DMA_CN_CH11_IEN_DIS << MXC_F_DMA_CN_CH11_IEN_POS) /**< CN_CH11_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH11_IEN_EN                       ((uint32_t)0x1UL) /**< CN_CH11_IEN_EN Value */
#define MXC_S_DMA_CN_CH11_IEN_EN                       (MXC_V_DMA_CN_CH11_IEN_EN << MXC_F_DMA_CN_CH11_IEN_POS) /**< CN_CH11_IEN_EN Setting */

