analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/dma_regs.h
#define MXC_F_DMA_CN_CH12_IEN_POS                      12 /**< CN_CH12_IEN Position */
#define MXC_F_DMA_CN_CH12_IEN                          ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH12_IEN_POS)) /**< CN_CH12_IEN Mask */
#define MXC_V_DMA_CN_CH12_IEN_DIS                      ((uint32_t)0x0UL) /**< CN_CH12_IEN_DIS Value */
#define MXC_S_DMA_CN_CH12_IEN_DIS                      (MXC_V_DMA_CN_CH12_IEN_DIS << MXC_F_DMA_CN_CH12_IEN_POS) /**< CN_CH12_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH12_IEN_EN                       ((uint32_t)0x1UL) /**< CN_CH12_IEN_EN Value */
#define MXC_S_DMA_CN_CH12_IEN_EN                       (MXC_V_DMA_CN_CH12_IEN_EN << MXC_F_DMA_CN_CH12_IEN_POS) /**< CN_CH12_IEN_EN Setting */

#define MXC_F_DMA_CN_CH13_IEN_POS                      13 /**< CN_CH13_IEN Position */
#define MXC_F_DMA_CN_CH13_IEN                          ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH13_IEN_POS)) /**< CN_CH13_IEN Mask */
#define MXC_V_DMA_CN_CH13_IEN_DIS                      ((uint32_t)0x0UL) /**< CN_CH13_IEN_DIS Value */
#define MXC_S_DMA_CN_CH13_IEN_DIS                      (MXC_V_DMA_CN_CH13_IEN_DIS << MXC_F_DMA_CN_CH13_IEN_POS) /**< CN_CH13_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH13_IEN_EN                       ((uint32_t)0x1UL) /**< CN_CH13_IEN_EN Value */
#define MXC_S_DMA_CN_CH13_IEN_EN                       (MXC_V_DMA_CN_CH13_IEN_EN << MXC_F_DMA_CN_CH13_IEN_POS) /**< CN_CH13_IEN_EN Setting */

#define MXC_F_DMA_CN_CH14_IEN_POS                      14 /**< CN_CH14_IEN Position */
#define MXC_F_DMA_CN_CH14_IEN                          ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH14_IEN_POS)) /**< CN_CH14_IEN Mask */
#define MXC_V_DMA_CN_CH14_IEN_DIS                      ((uint32_t)0x0UL) /**< CN_CH14_IEN_DIS Value */
#define MXC_S_DMA_CN_CH14_IEN_DIS                      (MXC_V_DMA_CN_CH14_IEN_DIS << MXC_F_DMA_CN_CH14_IEN_POS) /**< CN_CH14_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH14_IEN_EN                       ((uint32_t)0x1UL) /**< CN_CH14_IEN_EN Value */
#define MXC_S_DMA_CN_CH14_IEN_EN                       (MXC_V_DMA_CN_CH14_IEN_EN << MXC_F_DMA_CN_CH14_IEN_POS) /**< CN_CH14_IEN_EN Setting */

#define MXC_F_DMA_CN_CH15_IEN_POS                      15 /**< CN_CH15_IEN Position */
#define MXC_F_DMA_CN_CH15_IEN                          ((uint32_t)(0x1UL << MXC_F_DMA_CN_CH15_IEN_POS)) /**< CN_CH15_IEN Mask */
#define MXC_V_DMA_CN_CH15_IEN_DIS                      ((uint32_t)0x0UL) /**< CN_CH15_IEN_DIS Value */
#define MXC_S_DMA_CN_CH15_IEN_DIS                      (MXC_V_DMA_CN_CH15_IEN_DIS << MXC_F_DMA_CN_CH15_IEN_POS) /**< CN_CH15_IEN_DIS Setting */
#define MXC_V_DMA_CN_CH15_IEN_EN                       ((uint32_t)0x1UL) /**< CN_CH15_IEN_EN Value */
#define MXC_S_DMA_CN_CH15_IEN_EN                       (MXC_V_DMA_CN_CH15_IEN_EN << MXC_F_DMA_CN_CH15_IEN_POS) /**< CN_CH15_IEN_EN Setting */

/**@} end of group DMA_CN_Register */

/**
 * @ingroup  dma_registers
 * @defgroup DMA_INTR DMA_INTR
 * @brief    DMA Interrupt Register.
 * @{
 */
#define MXC_F_DMA_INTR_CH0_IPEND_POS                   0 /**< INTR_CH0_IPEND Position */
#define MXC_F_DMA_INTR_CH0_IPEND                       ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH0_IPEND_POS)) /**< INTR_CH0_IPEND Mask */
#define MXC_V_DMA_INTR_CH0_IPEND_INACTIVE              ((uint32_t)0x0UL) /**< INTR_CH0_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH0_IPEND_INACTIVE              (MXC_V_DMA_INTR_CH0_IPEND_INACTIVE << MXC_F_DMA_INTR_CH0_IPEND_POS) /**< INTR_CH0_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH0_IPEND_PENDING               ((uint32_t)0x1UL) /**< INTR_CH0_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH0_IPEND_PENDING               (MXC_V_DMA_INTR_CH0_IPEND_PENDING << MXC_F_DMA_INTR_CH0_IPEND_POS) /**< INTR_CH0_IPEND_PENDING Setting */

#define MXC_F_DMA_INTR_CH1_IPEND_POS                   1 /**< INTR_CH1_IPEND Position */
#define MXC_F_DMA_INTR_CH1_IPEND                       ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH1_IPEND_POS)) /**< INTR_CH1_IPEND Mask */
#define MXC_V_DMA_INTR_CH1_IPEND_INACTIVE              ((uint32_t)0x0UL) /**< INTR_CH1_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH1_IPEND_INACTIVE              (MXC_V_DMA_INTR_CH1_IPEND_INACTIVE << MXC_F_DMA_INTR_CH1_IPEND_POS) /**< INTR_CH1_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH1_IPEND_PENDING               ((uint32_t)0x1UL) /**< INTR_CH1_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH1_IPEND_PENDING               (MXC_V_DMA_INTR_CH1_IPEND_PENDING << MXC_F_DMA_INTR_CH1_IPEND_POS) /**< INTR_CH1_IPEND_PENDING Setting */

#define MXC_F_DMA_INTR_CH2_IPEND_POS                   2 /**< INTR_CH2_IPEND Position */
#define MXC_F_DMA_INTR_CH2_IPEND                       ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH2_IPEND_POS)) /**< INTR_CH2_IPEND Mask */
#define MXC_V_DMA_INTR_CH2_IPEND_INACTIVE              ((uint32_t)0x0UL) /**< INTR_CH2_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH2_IPEND_INACTIVE              (MXC_V_DMA_INTR_CH2_IPEND_INACTIVE << MXC_F_DMA_INTR_CH2_IPEND_POS) /**< INTR_CH2_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH2_IPEND_PENDING               ((uint32_t)0x1UL) /**< INTR_CH2_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH2_IPEND_PENDING               (MXC_V_DMA_INTR_CH2_IPEND_PENDING << MXC_F_DMA_INTR_CH2_IPEND_POS) /**< INTR_CH2_IPEND_PENDING Setting */

#define MXC_F_DMA_INTR_CH3_IPEND_POS                   3 /**< INTR_CH3_IPEND Position */
#define MXC_F_DMA_INTR_CH3_IPEND                       ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH3_IPEND_POS)) /**< INTR_CH3_IPEND Mask */
#define MXC_V_DMA_INTR_CH3_IPEND_INACTIVE              ((uint32_t)0x0UL) /**< INTR_CH3_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH3_IPEND_INACTIVE              (MXC_V_DMA_INTR_CH3_IPEND_INACTIVE << MXC_F_DMA_INTR_CH3_IPEND_POS) /**< INTR_CH3_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH3_IPEND_PENDING               ((uint32_t)0x1UL) /**< INTR_CH3_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH3_IPEND_PENDING               (MXC_V_DMA_INTR_CH3_IPEND_PENDING << MXC_F_DMA_INTR_CH3_IPEND_POS) /**< INTR_CH3_IPEND_PENDING Setting */

