analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/dma_regs.h
#define MXC_F_DMA_INTR_CH4_IPEND_POS                   4 /**< INTR_CH4_IPEND Position */
#define MXC_F_DMA_INTR_CH4_IPEND                       ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH4_IPEND_POS)) /**< INTR_CH4_IPEND Mask */
#define MXC_V_DMA_INTR_CH4_IPEND_INACTIVE              ((uint32_t)0x0UL) /**< INTR_CH4_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH4_IPEND_INACTIVE              (MXC_V_DMA_INTR_CH4_IPEND_INACTIVE << MXC_F_DMA_INTR_CH4_IPEND_POS) /**< INTR_CH4_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH4_IPEND_PENDING               ((uint32_t)0x1UL) /**< INTR_CH4_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH4_IPEND_PENDING               (MXC_V_DMA_INTR_CH4_IPEND_PENDING << MXC_F_DMA_INTR_CH4_IPEND_POS) /**< INTR_CH4_IPEND_PENDING Setting */

#define MXC_F_DMA_INTR_CH5_IPEND_POS                   5 /**< INTR_CH5_IPEND Position */
#define MXC_F_DMA_INTR_CH5_IPEND                       ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH5_IPEND_POS)) /**< INTR_CH5_IPEND Mask */
#define MXC_V_DMA_INTR_CH5_IPEND_INACTIVE              ((uint32_t)0x0UL) /**< INTR_CH5_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH5_IPEND_INACTIVE              (MXC_V_DMA_INTR_CH5_IPEND_INACTIVE << MXC_F_DMA_INTR_CH5_IPEND_POS) /**< INTR_CH5_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH5_IPEND_PENDING               ((uint32_t)0x1UL) /**< INTR_CH5_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH5_IPEND_PENDING               (MXC_V_DMA_INTR_CH5_IPEND_PENDING << MXC_F_DMA_INTR_CH5_IPEND_POS) /**< INTR_CH5_IPEND_PENDING Setting */

#define MXC_F_DMA_INTR_CH6_IPEND_POS                   6 /**< INTR_CH6_IPEND Position */
#define MXC_F_DMA_INTR_CH6_IPEND                       ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH6_IPEND_POS)) /**< INTR_CH6_IPEND Mask */
#define MXC_V_DMA_INTR_CH6_IPEND_INACTIVE              ((uint32_t)0x0UL) /**< INTR_CH6_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH6_IPEND_INACTIVE              (MXC_V_DMA_INTR_CH6_IPEND_INACTIVE << MXC_F_DMA_INTR_CH6_IPEND_POS) /**< INTR_CH6_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH6_IPEND_PENDING               ((uint32_t)0x1UL) /**< INTR_CH6_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH6_IPEND_PENDING               (MXC_V_DMA_INTR_CH6_IPEND_PENDING << MXC_F_DMA_INTR_CH6_IPEND_POS) /**< INTR_CH6_IPEND_PENDING Setting */

#define MXC_F_DMA_INTR_CH7_IPEND_POS                   7 /**< INTR_CH7_IPEND Position */
#define MXC_F_DMA_INTR_CH7_IPEND                       ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH7_IPEND_POS)) /**< INTR_CH7_IPEND Mask */
#define MXC_V_DMA_INTR_CH7_IPEND_INACTIVE              ((uint32_t)0x0UL) /**< INTR_CH7_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH7_IPEND_INACTIVE              (MXC_V_DMA_INTR_CH7_IPEND_INACTIVE << MXC_F_DMA_INTR_CH7_IPEND_POS) /**< INTR_CH7_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH7_IPEND_PENDING               ((uint32_t)0x1UL) /**< INTR_CH7_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH7_IPEND_PENDING               (MXC_V_DMA_INTR_CH7_IPEND_PENDING << MXC_F_DMA_INTR_CH7_IPEND_POS) /**< INTR_CH7_IPEND_PENDING Setting */

#define MXC_F_DMA_INTR_CH8_IPEND_POS                   8 /**< INTR_CH8_IPEND Position */
#define MXC_F_DMA_INTR_CH8_IPEND                       ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH8_IPEND_POS)) /**< INTR_CH8_IPEND Mask */
#define MXC_V_DMA_INTR_CH8_IPEND_INACTIVE              ((uint32_t)0x0UL) /**< INTR_CH8_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH8_IPEND_INACTIVE              (MXC_V_DMA_INTR_CH8_IPEND_INACTIVE << MXC_F_DMA_INTR_CH8_IPEND_POS) /**< INTR_CH8_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH8_IPEND_PENDING               ((uint32_t)0x1UL) /**< INTR_CH8_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH8_IPEND_PENDING               (MXC_V_DMA_INTR_CH8_IPEND_PENDING << MXC_F_DMA_INTR_CH8_IPEND_POS) /**< INTR_CH8_IPEND_PENDING Setting */

#define MXC_F_DMA_INTR_CH9_IPEND_POS                   9 /**< INTR_CH9_IPEND Position */
#define MXC_F_DMA_INTR_CH9_IPEND                       ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH9_IPEND_POS)) /**< INTR_CH9_IPEND Mask */
#define MXC_V_DMA_INTR_CH9_IPEND_INACTIVE              ((uint32_t)0x0UL) /**< INTR_CH9_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH9_IPEND_INACTIVE              (MXC_V_DMA_INTR_CH9_IPEND_INACTIVE << MXC_F_DMA_INTR_CH9_IPEND_POS) /**< INTR_CH9_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH9_IPEND_PENDING               ((uint32_t)0x1UL) /**< INTR_CH9_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH9_IPEND_PENDING               (MXC_V_DMA_INTR_CH9_IPEND_PENDING << MXC_F_DMA_INTR_CH9_IPEND_POS) /**< INTR_CH9_IPEND_PENDING Setting */

#define MXC_F_DMA_INTR_CH10_IPEND_POS                  10 /**< INTR_CH10_IPEND Position */
#define MXC_F_DMA_INTR_CH10_IPEND                      ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH10_IPEND_POS)) /**< INTR_CH10_IPEND Mask */
#define MXC_V_DMA_INTR_CH10_IPEND_INACTIVE             ((uint32_t)0x0UL) /**< INTR_CH10_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH10_IPEND_INACTIVE             (MXC_V_DMA_INTR_CH10_IPEND_INACTIVE << MXC_F_DMA_INTR_CH10_IPEND_POS) /**< INTR_CH10_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH10_IPEND_PENDING              ((uint32_t)0x1UL) /**< INTR_CH10_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH10_IPEND_PENDING              (MXC_V_DMA_INTR_CH10_IPEND_PENDING << MXC_F_DMA_INTR_CH10_IPEND_POS) /**< INTR_CH10_IPEND_PENDING Setting */

#define MXC_F_DMA_INTR_CH11_IPEND_POS                  11 /**< INTR_CH11_IPEND Position */
#define MXC_F_DMA_INTR_CH11_IPEND                      ((uint32_t)(0x1UL << MXC_F_DMA_INTR_CH11_IPEND_POS)) /**< INTR_CH11_IPEND Mask */
#define MXC_V_DMA_INTR_CH11_IPEND_INACTIVE             ((uint32_t)0x0UL) /**< INTR_CH11_IPEND_INACTIVE Value */
#define MXC_S_DMA_INTR_CH11_IPEND_INACTIVE             (MXC_V_DMA_INTR_CH11_IPEND_INACTIVE << MXC_F_DMA_INTR_CH11_IPEND_POS) /**< INTR_CH11_IPEND_INACTIVE Setting */
#define MXC_V_DMA_INTR_CH11_IPEND_PENDING              ((uint32_t)0x1UL) /**< INTR_CH11_IPEND_PENDING Value */
#define MXC_S_DMA_INTR_CH11_IPEND_PENDING              (MXC_V_DMA_INTR_CH11_IPEND_PENDING << MXC_F_DMA_INTR_CH11_IPEND_POS) /**< INTR_CH11_IPEND_PENDING Setting */

